src/cf/src/ChartsOfCharacteristicTypes/ПоказателиРасчётаПремий/ПоказателиРасчётаПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПоказателиРасчётаПремий</name>
  <type>
    <types>Boolean</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>12</precision>
      <scale>2</scale>
    </numberQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПремияПоПлану</name>
      <description>Prime selon le plan</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ФиксированнаяПремия</name>
      <description>Prime fixe</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ПроцентОтПродажСотрудника</name>
      <description>Pourcentage des ventes de l'employé</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ПроцентОтОбщегоОбъема</name>
      <description>Pourcentage du volume total</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ПроцентОтПродажПодразделения</name>
      <description>Pourcentage des ventes du service</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>SMART</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПродажАнализировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПродажВариант</name>
    <type>
      <types>EnumRef.ВариантыАнализаПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПродажПоказатель</name>
    <type>
      <types>EnumRef.ПоказателиПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Веса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПланаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПланаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоОтработаннымДням</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧАнализПродажПараметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧАнализПродажПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧАнализПродажСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧКоэффициентыПремии</name>
    <attributes>
      <name>ВыполнениеПлана</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/cf/src/InformationRegisters/ПремииСотрудников/ПремииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПремииСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Премия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПремии</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПоказателиРасчётаПремий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ПоказателиПродаж/ПоказателиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиПродаж</name>
  <enumValues>
    <name>Выручка</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтОплат</name>
  </enumValues>
  <enumValues>
    <name>Оплаты</name>
  </enumValues>
  <enumValues>
    <name>Прибыль</name>
  </enumValues>
  <enumValues>
    <name>Количество</name>
  </enumValues>
  <enumValues>
    <name>Рентабельность</name>
  </enumValues>
  <enumValues>
    <name>ЧистаяПрибыль</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ВариантыАнализаПоказателей/ВариантыАнализаПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыАнализаПоказателей</name>
  <enumValues>
    <name>ПоСотруднику</name>
  </enumValues>
  <enumValues>
    <name>ПоСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделению</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>ПоОрганизации</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/ChartsOfCharacteristicTypes/ПоказателиРасчётаПремий/ManagerModule.bsl
Функция ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, ВыполненныйПлан) Экспорт
	Если ТЗКоэффициентыПремии.Количество() = 0 Тогда
		ПроцентПремии = 100;	
	Иначе	
		ТЗКоэффициентыПремии.Сортировать("ВыполнениеПлана Убыв");
		ПроцентПремии = 0;
		Для Каждого Стр Из ТЗКоэффициентыПремии Цикл
			Если ВыполненныйПлан < Стр.ВыполнениеПлана Тогда Продолжить КонецЕсли;
			ПроцентПремии = Стр.ПроцентПремии;
			Прервать;		
		КонецЦикла;
	КонецЕсли;
	Возврат ПроцентПремии;
КонецФункции

Функция ПолучитьПоказателиПоСОтруднику(Сотрудник, НаДату = Неопределено) Экспорт
	ДатаРасчета = ?(НаДату = Неопределено, ТекущаяДатаСеанса(), НаДату);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПремииСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ПремииСотрудниковСрезПоследних.ВидПремии КАК Показатель,
	|	ЛОЖЬ КАК SMART,
	|	0 КАК План,
	|	0 КАК Факт,
	|	ПремииСотрудниковСрезПоследних.Премия КАК Стоимость,
	|	ПремииСотрудниковСрезПоследних.Премия КАК Премия
	|ИЗ
	|	РегистрСведений.ПремииСотрудников.СрезПоследних(&ДатаРасчета, Сотрудник = &Сотрудник) КАК ПремииСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("ДатаРасчета",ДатаРасчета);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Возвращает настройки вида премии для расчёта по РегистрСведений.ПремииСотрудников.
// Для предопределённых видов, у которых анализ продаж не настроен, подставляются значения
// по умолчанию (см. ЗначенияПоУмолчаниюПредопределенного).
//
// Параметры:
//  ВидПремии - ПланВидовХарактеристикСсылка.ПоказателиРасчётаПремий - вид премии.
//
// Возвращаемое значение:
//  Структура - АнализПродажАнализировать (Булево), АнализПродажВариант (ПеречислениеСсылка.ВариантыАнализаПоказателей),
//  АнализПродажПоказатель (ПеречислениеСсылка.ПоказателиПродаж), ПоОтработаннымДням (Булево),
//  Сотрудники (Массив), Подразделения (Массив), Параметры (Массив).
//
Функция НастройкиВидаПремии(ВидПремии) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыПремий.АнализПродажАнализировать КАК АнализПродажАнализировать,
	                      |	ВидыПремий.АнализПродажВариант КАК АнализПродажВариант,
	                      |	ВидыПремий.АнализПродажПоказатель КАК АнализПродажПоказатель,
	                      |	ВидыПремий.ПоОтработаннымДням КАК ПоОтработаннымДням,
	                      |	ВидыПремий.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ПоказателиРасчётаПремий КАК ВидыПремий
	                      |ГДЕ
	                      |	ВидыПремий.Ссылка = &ВидПремии
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Сотрудники.Сотрудник КАК Сотрудник
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ПоказателиРасчётаПремий.ТЧАнализПродажСотрудники КАК Сотрудники
	                      |ГДЕ
	                      |	Сотрудники.Ссылка = &ВидПремии
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Подразделения.Подразделение КАК Подразделение
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ПоказателиРасчётаПремий.ТЧАнализПродажПодразделения КАК Подразделения
	                      |ГДЕ
	                      |	Подразделения.Ссылка = &ВидПремии
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Параметры.Параметр КАК Параметр
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ПоказателиРасчётаПремий.ТЧАнализПродажПараметры КАК Параметры
	                      |ГДЕ
	                      |	Параметры.Ссылка = &ВидПремии");
	Запрос.УстановитьПараметр("ВидПремии", ВидПремии);
	Рез = Запрос.ВыполнитьПакет();
	Результат = Новый Структура("АнализПродажАнализировать, АнализПродажВариант, АнализПродажПоказатель, ПоОтработаннымДням", Ложь);
	Результат.Вставить("Сотрудники", Рез[1].Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	Результат.Вставить("Подразделения", Рез[2].Выгрузить().ВыгрузитьКолонку("Подразделение"));
	Результат.Вставить("Параметры", Рез[3].Выгрузить().ВыгрузитьКолонку("Параметр"));
	Выборка = Рез[0].Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Результат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Если Не Результат.АнализПродажАнализировать Тогда
		ПоУмолчанию = ЗначенияПоУмолчаниюПредопределенного(Выборка.ИмяПредопределенныхДанных);
		Если ПоУмолчанию <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Результат, ПоУмолчанию);
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Результат.АнализПродажПоказатель) Тогда
		Результат.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.Выручка;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Возвращает значения анализа продаж по умолчанию для предопределённого вида премии.
//
// Параметры:
//  ИмяПредопределенного - Строка - имя предопределённого элемента.
//
// Возвращаемое значение:
//  Структура, Неопределено - АнализПродажАнализировать, АнализПродажВариант, АнализПродажПоказатель;
//  Неопределено - для непредопределённых видов и видов без анализа продаж.
//
Функция ЗначенияПоУмолчаниюПредопределенного(ИмяПредопределенного) Экспорт
	ВариантыАнализа = Перечисления.ВариантыАнализаПоказателей;
	Если ИмяПредопределенного = "ПроцентОтПродажСотрудника" Тогда
		Вариант = ВариантыАнализа.ПоСотруднику;
	ИначеЕсли ИмяПредопределенного = "ПроцентОтОбщегоОбъема" Тогда
		Вариант = ВариантыАнализа.ПоОрганизации;
	ИначеЕсли ИмяПредопределенного = "ПроцентОтПродажПодразделения" Тогда
		Вариант = ВариантыАнализа.ПоПодразделению;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("АнализПродажАнализировать", Истина);
	Результат.Вставить("АнализПродажВариант", Вариант);
	Результат.Вставить("АнализПродажПоказатель", Перечисления.ПоказателиПродаж.Выручка);
	Возврат Результат;
КонецФункции
